cases/hydrodynamic/planarInterface3D/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// zVelocity 0.01;

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

// NOTE: the boundary conditions differ from those given in Popinet2009.
// In that publication, symmetry and periodic boundary conditions
// are used.
boundaryField
{
    mantle
    {
        //type            fixedValue;
        //value           uniform (1 0 0);
        type slip;
    }
    outlet
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
}


// ************************************************************************* //
