cases/hydrodynamic/planarInterface3D/system/setAlphaFieldDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setAlphaFieldDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

field           alpha.water;
type            plane;
// TODO: parameterize
// normal orthogonal to velocity
// Plane standing still
//normal          (0 0 -1);
// normal collinear with but negative to velocity
// Plane movinng with a constant velocity
normal          (-1 0 0);

// Case 1: wherever alphaf != 0 or alphaf != 1, alphaf = 0.5
//origin          (1 0.5 0.625);  
// Case 2: wherever alphaf != 0 or alphaf != 1, alphaf = 0.8
origin          (0.31 0.5 0.7);  

// ************************************************************************* //
